Autodesk.Revit.DB.ChangeType.Contains(Autodesk.Revit.DB.ChangeType)
Checks whether this ChangeType contains the input ChangeType
Returns:
True if input changeType is contained by this ChangeType
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ChangeType.IsIdentical(Autodesk.Revit.DB.ChangeType)
Compares if two ChangeTypes are identical
changeType:
Input ChangeType to be compared
Returns:
True if the this ChangeType and input ChangeType are identical
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ChangeType.ConcatenateChangeTypes(Autodesk.Revit.DB.ChangeType,Autodesk.Revit.DB.ChangeType)
Creates a ChangeType that is a union of the two input ChangeTypes
changeType1:
First input ChangeType to be concatenated
changeType2:
Second input ChangeType to be concatenated
Returns:
A new ChangeType that is a concatenation/union of the input change types
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011